In [2]:
import pandas as pd

In [5]:
df = pd.read_csv('supershops.csv')

In [6]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

## Normalization

https://scikit-learn.org/stable/modules/classes.html#module-sklearn.preprocessing


MinMaxScalaer: https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.MinMaxScaler.html#sklearn.preprocessing.MinMaxScaler

In [ ]:
## Marketing Spend

In [7]:
from sklearn.preprocessing import MinMaxScaler

In [8]:
m = MinMaxScaler()
# m = MinMaxScaler(feature_range=(2, 4)) # feature_range=(0, 1) 0 to 1 is default

In [19]:
df1 = df.copy()
df2 = df.copy()

In [10]:
df1.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

fit marketting spend

In [11]:
df1_Marketing_Spend = m.fit(df1[['Marketing Spend']]) # simply training

In [12]:
df1_Marketing_Spend

MinMaxScaler()

In [13]:
df1.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

transform marketing spend

In [14]:
df1[['Marketing Spend']] = m.transform(df1[['Marketing Spend']]) # simply transforming

In [15]:
df1.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

fit and transform on 'Administration'

In [16]:
df1[['Administration']] = m.fit_transform(df1[['Administration']]) # fit and transform together

In [17]:
df1.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744  471784.10    Dhaka  192261.83
1         0.983359        0.761972  443898.53      Ctg  191792.06
2         0.927985        0.379579  407934.54  Rangpur  191050.39
3         0.873136        0.512998  383199.62    Dhaka  182901.99
4         0.859438        0.305328  366168.42  Rangpur  166187.94

In [18]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Marketing Spend  50 non-null     float64
 1   Administration   50 non-null     float64
 2   Transport        49 non-null     float64
 3   Area             50 non-null     object
 4   Profit           50 non-null     float64
dtypes: float64(4), object(1)
memory usage: 2.1+ KB

Min Max Scaler using for loop

In [20]:
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [21]:
x = df2.drop('Profit', axis=1)
y = df2[['Profit']]

In [22]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [37]:
x1 = x.copy()
x2 = x.copy()
x3 = x.copy()
x4 = x.copy()
x5 = x.copy()
x6 = x.copy()
x6 = x.copy()

In [26]:
x1.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [24]:
y.head()

      Profit
0  192261.83
1  191792.06
2  191050.39
3  182901.99
4  166187.94

In [30]:
numeric_columns = x1.select_dtypes(include=['number'])

numeric_columns.head()

   Marketing Spend  Administration  Transport
0        114523.61       136897.80  471784.10
1        162597.70       151377.59  443898.53
2        153441.51       101145.55  407934.54
3        144372.41       118671.85  383199.62
4        142107.34        91391.77  366168.42

In [31]:
# Apply the transformation to all numeric columns
x1[numeric_columns.columns] = m.fit_transform(numeric_columns)

In [32]:
# Display the transformed DataFrame
x1.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744   1.000000    Dhaka
1         0.983359        0.761972   0.940893      Ctg
2         0.927985        0.379579   0.864664  Rangpur
3         0.873136        0.512998   0.812235    Dhaka
4         0.859438        0.305328   0.776136  Rangpur

using for loop

In [34]:
# Create a list of column names for numeric columns
numeric_columns = x2.select_dtypes(include=['number']).columns

numeric_columns

Index(['Marketing Spend', 'Administration', 'Transport'], dtype='object')

In [35]:
# Apply the transformation using a for loop
for column in numeric_columns:
    x2[column] = m.fit_transform(x2[[column]])

In [36]:
x2.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744   1.000000    Dhaka
1         0.983359        0.761972   0.940893      Ctg
2         0.927985        0.379579   0.864664  Rangpur
3         0.873136        0.512998   0.812235    Dhaka
4         0.859438        0.305328   0.776136  Rangpur

##  Standardization

https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.StandardScaler.html#sklearn.preprocessing.StandardScaler

In [38]:
from sklearn.preprocessing import StandardScaler

In [39]:
scaler = StandardScaler()

In [40]:
x3.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [42]:
numeric_columns = x3.select_dtypes(include=['number']).columns
numeric_columns

Index(['Marketing Spend', 'Administration', 'Transport'], dtype='object')

In [43]:
# Apply the transformation using a for loop
for column in numeric_columns:
    x3[column] = scaler.fit_transform(x3[[column]])

In [44]:
x3.head()

   Marketing Spend  Administration  Transport     Area
0         0.897913        0.560753   2.165287    Dhaka
1         1.955860        1.082807   1.929843      Ctg
2         1.754364       -0.728257   1.626191  Rangpur
3         1.554784       -0.096365   1.417348    Dhaka
4         1.504937       -1.079919   1.273550  Rangpur

## Max Absolute Scaler

In [ ]:
from sklearn.preprocessing import MaxAbsScaler

preprocessing : https://scikit-learn.org/stable/modules/classes.html#module-sklearn.preprocessing

MaxAbsScaler: https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.MaxAbsScaler.html#sklearn.preprocessing.MaxAbsScaler

In [45]:
from sklearn.preprocessing import MaxAbsScaler

In [46]:
transformer = MaxAbsScaler()

In [47]:
numeric_columns = x4.select_dtypes(include=['number']).columns
numeric_columns

Index(['Marketing Spend', 'Administration', 'Transport'], dtype='object')

In [48]:
# Apply the transformation using a for loop
for column in numeric_columns:
    x4[column] = transformer.fit_transform(x4[[column]])

In [49]:
x4.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.749527   1.000000    Dhaka
1         0.983359        0.828805   0.940893      Ctg
2         0.927985        0.553781   0.864664  Rangpur
3         0.873136        0.649738   0.812235    Dhaka
4         0.859438        0.500378   0.776136  Rangpur

## Robust scaler

In [50]:
from sklearn.preprocessing import RobustScaler

In [51]:
rob_scaler = RobustScaler()

In [52]:
numeric_columns = x5.select_dtypes(include=['number']).columns
numeric_columns

Index(['Marketing Spend', 'Administration', 'Transport'], dtype='object')

In [54]:
# Apply the transformation using a for loop
for column in numeric_columns:
    x5[column] = rob_scaler.fit_transform(x5[[column]])

In [55]:
x5.head()

   Marketing Spend  Administration  Transport     Area
0         0.672530        0.345355   1.552016    Dhaka
1         1.452113        0.697565   1.383714      Ctg
2         1.303634       -0.524290   1.166654  Rangpur
3         1.156567       -0.097977   1.017368    Dhaka
4         1.119836       -0.761543   0.914576  Rangpur